<SOS>
<EOS>
<PAD>
<UNK>
[chorus]
what
are
words
worth?
[verse
1]
in
papers,
books
on
tv,
for
crooks
of
comfort,
peace
to
make
the
fighting
cease
tell
you
do
working
hard
eat
your
but
don't
go
hungry
have
always
nearly
hung
me
a
ram
sam
sam,
hi
yay,
yippie
yi
yay
awoo
ayee
2]
skill
and
romance
thrill
stupid,
fun
can
put
run
mots
qui
la
le
fruit
3]
it's
rap
race,
with
fast
pace
concrete
words,
abstract
crazy
lying
hazy
dying
faith
straight
rare
swear
good
bad
4]
pay
four-letter
i
cannot
say
toilet,
dirty
devil
trouble,
subtle
anger,
hate
over
here,
out
there
air
everywhere
wisdom,
strife
that
write
book
like
won't
find
no
right
solution
planet
earth's
pollution
word,
million
certain
person
who
can't
they
mean
rap,
here
it
up
common
let
us
enlist
neighborhood
okay,
i've
this
is
bye
[instrumental]
[outro]
he'll
stop
december,
drinking
i'd
look
psychotic
winter's
cold
too
much
handle
crabs
pinch
at
sandals
down
glasses
lips
teeth
ask
how
my
day
went
boots
fists
pound
pavement
comes
feeling
thought
you'd
forgotten
chairs
sit
sidewalks
walk
remember
still
enjoy
foot
oh,
had
no,
lost
looking
back,
shouldn't
fought
years
by
hearts
start
harden
those
palms
grew
garden
falling
nearing
roots
shooting
through
tool
shed
asked
shouting
cracks
understood
so
night,
hear
'em
talk
coldest
story
ever
told
somewhere
far
along
road
he
his
soul
woman
heartless
could
be
heartless?
as
winter
wind
when
breeze,
yo?
just
talkin'
though
need
watch
way
me,
yo
mean,
after
all
things
we
been
got
into
ayo,
know
some
ain't
did
that's
old
now
wanna
get
back
gon'
show
around
new
friend,
well,
homies
end,
lonely
dr.
evil?
you're
bringin'
side
decided
wasn't
speak
why
3
am
phone?
she
mad
homie,
know,
she's
hot
stop,
mess
groove
‘cause
already
thing
friends
leavin'
see
wait
couple
months,
then
you'll
never
nobody
better
than
(me)
[bridge]
baby,
let's
knock
off
'bout
somethin'
keep
hatin'
enemies
believe
leave
wrong
i'm
take
tonight
night
and,
[intro:
connie
mitchell]
flashing
lights
lights)
1:
kanye
west]
shootin'
stars
shoes
cars
wood
floors
apartment
couture
from
more
"love
shit"
trips
florida
ordered
views
water
page
favorite
author
weather
breezy
man,
life
easy?
mirror
dancin'
sleazy
call
like,
"where
you,
try
hit
'til
flashed
paparazzi
damn,
these
niggas
nazi
[chorus:
&
recall,
love
would
know?
2:
while,
sweetheart
hardly
talk,
was
doin'
thang
foul,
baby
ayy,
babe,
lately,
you've
brain
if
somebody
woulda
month
ago
frontin',
though,
yo,
wouldn't
year
it'll
difficult
feelin'
katrina
martin
gina
flight
visa
first
class
seat
ya
past,
other
glass
memory's
museum
sayin',
hey,
mona
lisa
come
home,
roam
without
caesar
[outro:
lights,
[produced
tricky
stewart]
justin
bieber]
woah
care
shout
whenever
i'll
want
love,
heart
will
never,
ever,
apart
an
girl,
quit
playin'
we're
friends,
sayin'?
said
"there's
looked
eyes
broke
time,
oh
mine,
mine
done
whatever
together
play
cool,
losin'
buy
anything,
any
ring
pieces,
fix
shake
wake
dream
goin'
down,
around,
3:
13,
compared
came
between
us,
nor
above
starstruck
woke
daily,
starbucks
made
pound,
skip
beat
her
street
school
playground,
really
weekend
knows
'cause
amazin'
breakin',
sayin'
gone,
yeah
gone
option
(hey,
hey)
refuse
took
chance
feel
taking
loving,
bet
give
nothing's
gonna
tear
number
doubt
another
every
single
summer
one
and—
mission
hear,
listen
attention
missing
many
times
guess
being
takes
long
waiting,
there's
nothing
left
loving
smack
turn
bitch
slap
bro
(no,
no)
givin'
anxieties
bash
mind
terrorizing
bin
laden
fallin'
lose
control
shackle
chained
feels
stained
explain
itch
lately
whole
aim
maintain
regain
mainframe
bloods
boiling
its
beatin'
propane
train
thoughts
runaway
car
drivin'
lane
rain
might
[hook]
fear
none
bullets
dealing
something
worse
that'll
fall
knees
anxiety
sane
insane
rivalry
brought
lord,
please,
please
away
head
keeps
running
brother
only
making
stay
gotta
myself
god,
enemy
own
gots
inner
wealth
hold
caught
emotions
trapped
set
lock
stuck
goin
motions
what's
filled
pain
tryin'
gain
sanity
dead
end
front
nowhere
strange
paranoia
weighin'
longer,
ground
[instrumental
bridge]
'round
town
girl
"fuck
you"
(ooh,
ooh,
ooh)
change
pocket
enough
fuck
too"
said,
richer,
hah,
shit?
(ain't
although
chest,
wish
best
ooh-ooh)
yeah,
sorry,
afford
ferrari
he's
atari
game
fair
[pre-chorus]
pity
fool
falls
shit,
gold
digger
(well)
should
nigga
news
little
boyfriend
borrow,
hah
beg
steal
lie
cheat
ya,
ass
cheap,
nah
now,
wanna,
hurt
bad?
(so
bad,
bad)
tried
momma,
"this
(your
dad,
dad)
yes,
did,
uh,
why?
why,
lady?
sun
"what
up"
morning
brush
clip
since
last
bud
float
somehow
bedroom
mirror,
cool
happy
peter
pan
minus
tights
fairies
same
place
began
dreams
imagination
perfectly
move
bit
higher
up-up
away,
judge
anyway,
so,
they'll
learnin'
cooler
mom
niece
sing
along,
lil
mama
worry
drama,
provide
fam
fans
cleveland
city
grinding,
man
afloat,
key
hope
motherfucker
break
dawg
gives
fuck?
buzz
people
dudes
critique
clothes
most
gay
fly,
fly
freedom,
hey
up,
wake,
(yeah)
(we'll
rolling
up)
(i'll
challenge
awaits
test
prepared
hell
must
conquer
destroy
level
growth
confront
himself
machine
ghost
within
journey,
moon
big
ego
(ha
ha
i’m
such
big,
ego,
stroke
joke
bit,
welcome
wonderful
world
throw
blow
talking
what,
grow
"i
don’t
understand
trippin’,
me"
flow
emit
spit,
probably
raised
gas
prices
everybody
club
fresh
want,
tryna
recession
free
rock
stadium
sweaty
bring
extra
tee
standing
next
jay
b
coulda
anywhere
world,
you’re
that’s
wherever
imaginary
friend
imagining
league,
kobe
puff
killers
kill
self
esteem
or
use
arrogance
steam
power
beyoncé]
work
boss
real,
consider
lucky,
deal
it,
rather
open
body
secrets,
didn't
inside
wide
strong,
fit
much,
tough
cause
huge
usually
humble,
choose
blues
confident
decide
damn
killing
them
legs
yet
thighs
matter
fact
smile
maybe
boy
sight
see,
kind
loves
[bridge:
i,
admit
reason
beat,
whoa...
whoa,
whoa
whoa-oh-oh-oh
woo
(oh,
oh-oh-oh
oh-oh-oh)
[pre-chorus:
bruno
mars]
billionaire
fucking
cover
forbes
magazine
smiling
oprah
queen
time
close
name
shiny
different
prepare
travie
mccoy]
host
everyday
christmas,
list
pull
angelina
brad
pitt
adopt
bunch
babies
shit
few
mercedes,
lady,
not
least,
grant
their
months
claus
aha,
it?
visit
where
sure
lot
forget
about
stupid
go,
i'ma
theme
music
mars
(what
(for
what?)
oh-oh,
oh-oh
(let's
go)
playing
basketball
president
compliment
him
political
etiquette
toss
heck
completely
separate
tax
bracket
crack
whatever's
split
bucks
tummy
eating
good,
sleeping
soundly
similar
pocket,
wallet
(buy
everything,
(sing
it)
(oh)
[intro]
mum
mah
texas,
(woo)
fold
'em,
raise
(i
lovegame
intuition,
cards
spades
hooked,
woah-oh,
oh-oh-oh-oh-oh-oh
hot,
read
my,
poker
face
(she's
nobody)
[post-chorus]
p-p-p-poker
face,
(mum
mah)
roll
him,
pair
gamblin'
woo)
russian
roulette
gun
rough,
isn't
fun,
kiss
hug
bluffin'
muffin
lyin',
chick
casino
bank
before
promise
this,
check
hand
marvelous
visual
jb
ye,
up?
stacks
international
house
pancakes
alone,
ready
phone
shakes
wet,
regret
miles
deck
happened,
seen
blinked
threw
thinking
cap
her,
slide
jamaica
shop
two,
diego
obvious,
mami
clyde,
bonnie
walls,
halls
master
piece
hall
money
tied
knots
stand
there,
happen
blocks
brazil
cut
sweater,
audi
leather
field,
going?
'fore
does
expect
do?
find,
sweet
love?
searching
low
high,
letting
until
west
diamonds
"yo,
suits
grey
stuntin'
louis,
shorts
door
movies
meet
parents,
de
zero,
weirdo
show,
zeros
rockin'
sixteen
drums
tellin'
wu-tang
taught
young
youth,
tooth
drop
top,
bumpin'
question,
summer's
blazin'
say,
"you
lookin'
colored
raw,
used
g-unit
olivia
gettin'
numbers
hugs
became
face?
blind?
away?
4:
sittin'
chillin'
two
brothers
both
live
deck,
independent,
shorty
month,
wakin'
restin'
sweats
thinkin'
even
stress
terrible
waste
lost,
crazy,
floss
homies,
baloney
chillin',
honey
life,
that?
me?
justin,
shine
mind,
who's
women
children
first,
laugh
swallow
burst,
haven't
enough,
alive
everything
ice
age
coming,
coming
sides,
fire,
happening,
happening
chirping
run,
first)
(and
young,
may
anymore
hands
hides
true
en
su
halo
finger,
mexico,
rejoice
point,
name,
alejandro
fernando
kiss,
touch
smoke
cigarette
hush
roberto
[interlude]
broken,
boyfriend's
dad
flames
burned
bother
bye,
babe
(don't
name)
(i'm
babe)
touch)
(just
hush)
breaking
heart?
praying
[verse:
soul?
flow?
go?
need,
real
edward
maya]
deny,
blown
body,
losing
[hook
cry,
beautiful
[chorus
lies
hiding
pain,
smilin'
ricky
blaze
nina
sky]
major
switch
blaze,
sky
stars,
bar
girls
watching
afar
shining
dark
saw
sexy
thing,
biting
whispered
"do
party
truck,
6
chicks
deep
rollin'
(all
night)
dance
floor,
heat
room
everyones
desire,
dj
heard
today
going
harder
song
louder
oh)
(yeah,
yeah)
(keep
louder)
(my
we'll
gather
party,
lazer
solid
blood
bleed
spouse
proper
(isn't
much)
(that
need)
(a
soul)
bleed)
(but
girl),
want)
house)
[verse]
(there
fancy
part
freshest
wave
will,
heart,
father's
grave
seem
material
social
status
four
walls
purple,
people,
plastic
choir]
because
taps
hundred
drink
drink,
cup
connected
moment
staring
sky,
star
pray
on,
having
daydream
whose
reality
knew,
dove
downward
slope
believed
chances
were
approaching
grabbed
near,
weary
bird,
paper
bag
hunger
hurts
kills
clean
shaky
hurts,
starving
works
costs
again
strand
climb,
couldn't
fail
cope
"honey,
justified
"it's
everything"
starving,
hmm,
hmm
oh-oh-oh-oh-oh,
oh-oh-oh-oh,
roma
gaga,
"ooh
ugly,
disease
it’s
ey
(hey!)
sand
(love,
love)
revenge
(oh-oh-oh-oh-oh)
lover's
horror,
design
criminal
uh
psycho,
vertigo
rear
window,
sick
('cause
bitch,
baby)
[bridge
walk,
fashion,
passion,
je
veux
ton
amour
et
ta
amour,
back)
(caught
romance)
(want
quick
room,
plan
rolled
hanging
mouth,
cowboy
kid
found
dad's
closet
box
kids
pumped
kicks
outrun
faster
bullet
daddy
home
late,
late
bringing
surprise
dinner's
kitchen
packed
waited
sleight
trigger
"your
hair's
must've
john
lucky
grade
sad
photograph
blew
notice
changed
crowd
stood
stared
they'd
lords
film
today,
english
army
won
war
turned
[refrain:
eight,
nine,
clock
paul
fell
bed
dragged
comb
across
downstairs
drank
noticed
coat
hat
bus
seconds
flat
upstairs
spoke
[interlude:
ah-ah-ah,
thousand
holes
small
count
fill
albert
outro]
one,
three,
uh!
(uh)
door?
(ah)
fight
alone
thank
god
sticking
(c'mon)
ya!
think
"got
it"
till
(ah!)
together,
feelings
involved
is,
"nothing
forever"
makes,
makes
denial
here?
y'all
(uh-oh)
caddy
i'm,
honest
fellas
cool?
(ice
what's,
right,
okay
ladies
baddest
behavior
lend
sugar,
neighbor
ah,
go!
sh-shake
polaroid
picture,
(okay),
sugar
picture
lucy
dolls,
floor
do,
(uh-oh,
ya!)
uh-oh)
meetin'
night's
alight
midnight
cheer
our
dust
petals
drawin'
circles
protect
seed
wants
garden,
pardon
territory
knew
kinda
friendly
cautious,
losses
easily
dangerous
distracted
voice
choice
thinkin'?
under
siege
share
you)
giddy
place,
prime
pastel
trailer
park,
bright
hide
quiet
yard
dust,
rust
means
wanderlust
frequently
prefer
longest
horse
we've
found,
follow
they're
waiting
waving
craving
yes
able
proudly
anyway
martha,
dear
spend
days
conversation
silly
yourself
thick
help
look,
bound
meant
each
break]
out,
inspiration
breaks,
aches
kindness
linger
longer
needs
wakes
doesn't
has
hurry
eyes,
sign
behind
tears
cried
lasted
says
horn
solo:
alan
goes
someone
5]
lennon
george
people!
eleanor
rigby
picks
rice
church
wedding
lives
waits
window
wearing
jar
for?
from?
belong?
father
mckenzie
writing
sermon
near
socks
care?
died
buried
wiping
dirt
walks
saved
(ah,
woman's
loud
warm
kicked
born
york
times'
effect
whether
mother
stayin'
alive,
breakin'
shakin'
ha,
well
high
either,
wings
heaven
dancing
alright,
life's
nowhere,
man:
mother,
be?"
"will
pretty,
here's
be,
future's
ours
que
be"
ahead
rainbows,
day?
said:
handsome,
tenderly
desires
fires
trust
lust
accurate
devotions
emotions?
doing
hoping
you’ll
i’ma
point
scars
marks
collar
mmhmm
played
provoke
burns
turns
werewolf
aware
one’s
scale
drama
score
state
tour
allure
screams
rage
ahhhhh
cage,
hannibal
psycho
iller
version
thriller
michael
recital
light
eiffel
paris,
livin'
vitals
i’ll
con
liar
vampire
bite
neck
familiar
die,
fuckin'
killed
let’s
create
darkness
blinded
understand,
soft,
silky
long,
thin
candlelight
complexion
upon
skin
lightens
day,
separated
desire
contain
quality
admire
pretty
plain
simple,
rule
ooh
sort
starts
ear
delay
system
positive
emotion,
bust
often
wonder
discuss
care,
jay-z]
uh-huh,
uh-huh
(good
(take
action)
clouds
stones
rain,
dow
jones
come,
weather,
(you
me)
anticipation
stack
chips
rainy
miss
sunshine,
rihanna,
at?
rihanna]
worlds
magazines
shine,
forever
oath,
stick
raining
umbrella
umbrella,
ella,
eh,
eh
eh-eh
entity
infinity
dealt
mend
arms
alarmed
distance
pour
rainin',
rainin'
pourin'
lit
fuse,
ticking
bomb,
switching
sides
gemini
games
hitting
drum,
lady
luck
gets
rough
knocks
talks
bangs,
bangs
moves,
moves
looks
flower
stings
bee
history
wasted
fine
reminds
link
daisy
chain
sounds
diamond
map
wear
band
crime
lace
'till
disagree?
traveled
seven
seas
everybody's
abuse
abused
movin'
beauty
movie
scene
"don't
round
billie
jean
caused
dreamed
bein'
[pre-chorus
"be
careful
girls'
(oh-oh)
becomes
lover
claims
son,
hoo!
son
no-no-no,
forty
nights,
law
schemes
plans
danced
round,
hee!
strong
advice,
twice
twice)
twice!
we'd
showed
photo
cryin',
smell
perfume
happened
soon
called
hoo!)
(hoo!)
(oh
[break]
no-no-no-no
(she
girl)
scene)
aaow!
ooh!)
timbaland]
outta
minutes
minutes,
aye
(four,
four)
ow,
c'mon
ah.
breakdown,
timberlake]
c'mon,
madonna
madonna,
pick
stroll,
ah
sign,
roll,
mmm
speed
slow
that,
on)
i'mma
save
hesitating
grab
boy,
heh,
[post-chorus:
both]
hop
(tick
tock,
tick
tock)
sometimes
"you"
move,
paved
intentions,
die
tonight,
least
wanted
you?
(come
madonna]
paranoid
song,
ahaha
paranoid?
paranoid,
things,
alone?
hood
checkin'
cell
phone,
vibe
fight,
west,
mr.
hudson
(they
know)
(never
complain
nights
gratitude
attitude
word
mouth
finally
heartbreak
hotel
closed
(hey)
(to
floor)
once
difference
blowin'
street,
blind,
pretending
broken
bottle
top
man's
wind,
starting
asking
ways
message
clearer
na-na-na
victim
selfish
realize
nickel
loan
willow
deeply
scarred,
somebody's
pattern
[extended
chorus]
(who?)
(man
(change
ways)
change)
while
can't)
(close
your,
man)
(ooh!)
ways,
that)
change!
hoo,
hoo
(change)
lift
yourself,
(make
mirror)
to,
brother,
(yeah),
change,
future
seemed
evil
surprised
angels
wicked
extremes
hero
burn
alright
cry
lie,
gravel
voices
shattered
tug
war,
win
feed
fables
violent
empty
threats
battles
satisfied
masochist
memories
morning,
hits
smeared
makeup
lay
destruction
(shh)
softly,
awfully
sorry
pushed
coffee
table
push
scream
puppy
nothing,
ugly
am,
shove
aftermath
destructive
path
knives
other's
backs
mountains,
mountains
twice,
three
times,
forever,
youth
fountain
nuts,
refused
huge,
square
feet
ground,
dev]
poppin
bottles
ice,
blizzard
sippin
ride,
g6
g6,
gimme
moet
cristal
style,
gettin
wild
poppin',
drip
cuz
sober
actin'
drunk
drunk,
fizz
gangsta,
poppin'
crib
live,
head,
actin
808
bump,
this)
rihanna
drake]
na-na,
name?
soft
root
sixty-nine
eight
somethin',
right?
weed,
white
wine,
radio
leave,
waitin'
traffic
jam
finish,
twenty
mighty
text
but,
balance
explore
talent
downtown
type
na,
na
guy
woah,
forth,
surrender
whisper
enter
amazing
figure
past
turnin'
mo
catch
playa
toe
ladies,
plenty
men
runnin'
men,
worried
'bout?
getting
"hi,
freak
mistaken
easy
all,
five
load
cock
boom
bye-bye
standards
lower,
aimin'
fact,
better,
goodbye
nicki
minaj]
excuse
fixin'
be?
motherfuckers
fish
sea
sweatin'
tightest
hole
microscope
dome,
dome
trippin'
money,
tv
production
company
rhymes
chile
really?
laid
beach,
feeding
fat
bitches
way,
ridin'
living
player,
(ayy)
dime
dozen
nothin'
homie
there’s
(okay)
sean
kingston]
eenie
meenie
miney
holla
closer,
wrong,
disappear
rewind,
lover,
missing,
paradise
winning
dice
guys?
kingston
moe,
holla,
if,
la,
ayy
ryan
holding
rope
ten
hearing
sound
(ayy,
ayy)
apologize
fall,
shot
oh-woah
new,
loved
fire
red
turning
blue,
angel
afraid
apologize,
(too
late)
[refrain]
reach
personal
jesus
prayers
cares
unknown
flesh
bone
telephone
believer
second
best,
chest
confess
deliver,
forgiver
(reach
out)
butt
broad
daylight,
feel,
shoot
stuff
game,
sky's
limit
true,
(bad,
really,
(really,
answer
lyin'
throwin'
tomorrow
(hoo,
hoo)
(hoo)
smooth,
fergie]
further
badly,
biggest
thinking,
borderline
limit,
will.i.am]
travel
sail
universe
galaxies
navigate
myself,
uptown,
always,
halfway
cross
bridge
i)
skies
for,
[breakdown:
children,
one?
paradise,
obey,
invite
anything
dressed
wine
time?
idea
replace
life?
impress
mother's
mourning
dress
preacher,
father,
land
lived
king
deserve
subject
named
electra
passion
ladder
salvation
steps
reward
great
self-worth
(everybody's
caress
size
decrease
(how
started)
end)
god's
creation
undress
spent
answers
started
half
story,
dream?
climb
between,
everybody,
(it's
easy)
do!)
great,
mcgee
several
seems
busy
walked
door,
wore
raspberry
beret
store
built
was,
nerve
planned
harm
bike
and-a
riding
farm
overcast
mixed
kissed
barn
roof
horses
thunder
drowns
lightning
sees
listen,
greatest
hip
voiceless
become,
mainstream
symbol
panic,
join
hittin'
vip
fake
mustache
id
wooly
willy
bypass
bouncer
pass
ex
flex
bounce
hoes
ride
hose
spot
booty
says,
mio
mi
africa!
oooh
bo
cream
sundae
cherry
careful,
cherry,
pop
weasel
jackson
suggestion
bo,
question
splattered
spanish,
french,
swedish
slime
junk
bipolar
(yea)
growin'
chromosome
buns
case
runs
streets,
makin'
records
streets
poverty,
success
rebuild
instead
putting
spinning
rims
jet
(uh,
chorus
comin'
fume
tuna
later
met
fucked
elevator
levels
jingle
song's
almost
completed
ditty
needed
instrument
double
[part
i:
man?
gave
palm
endin'
confused
fair?
down?
goodbye?
should've
known
claimed
(on
now)
(maybe
same)
funny
shame
(no)
(hmm)
(now
heart)
ii:
yep,
yep
paint
get's
tone
goes?
cheated,
classic
case,
scenario
tale
deserved
cure
sympathy
timberlake
around)
hahahaha
'em)
listened
(hey
drove
screams,
strength,
lifetime
fault,
monster
beast,
feast
throne,
riches
silence
(givin'
i’ve
it'd
step
world?
saying,
"little
(do
it?)
(this
good)
quiet,
shy
talking,
what’s
hell,
cares?
slave
won’t
deny
(are
ready?)
leaving
can’t
myself)
move)
uh)
(like
(it
(here
likes
watch,
ap
hours
songs,
bought
mp3
bold
bb
black
tt
suspenders
positions
action
pose
lv
spilling
nike
raving
london
nyc
visa,
diva
dealer
guest
mafia
full
vodka
tequila
surrounded
bunnies
easter
mild
amnesia
lindsay
lo
balling,
fifa
standard
procedure
miami
ibiza
p.
diddy
girl?)
glasses,
jack
toes,
toes
clothes,
boys
phones,
phones
cds
pullin'
parties
tipsy
dj,
speakers
sunlight
tock
beer
linin'
swagger
kick
curb
unless
mick
jagger
crunk,
crunk
junk,
police
shut
po-po
build
pounds,
sound,
rude
enough?
captain
rider
giddy-up,
whatchu
boom,
nah,
relax,
buckle
stronger
hair
faking,
there'
(love
record
henny
xo,
dick
bounce,
average
ho
acting
(where
at?)
(in
numbered,
(fuck
baseball
bat
ripped
saucy
whip
fuck,
cost
gangsta
kidding
sippin'
g,
holiday,
holiday
dozing
underneath
sheets
ears
fear?
clear
republic
beach
counting
vegetarian
invasion
she'd
ak
display
t-shirt
lovely,
wheels,
cutter
spray
healthy
sense
worth
gasoline
surf
necklace
pawn
handsome
baton
blind
opera
pit
pendulum
drawn
ruins
domino
backdrop
sleeping?
velvet
overtaken
dim
chandelier
awaken
dissolved
dawn
costly
bow
muted
swan
sleeping,
john?
towers
hour
strike
quicksilver
carriage
fog
two-step
lamp
cellar
tune
laughs
auld
lang
syne
raised,
fired
rose
fullness
toasting
port
adieu
choke
grief
beyond
belief,
mm-mm,
mm-mm
aboard
tidal
spring
children's
child,
child
ready,
[2x]
[3x]
ready?
truth
complicated
line
lifetime,
green]
more?
dream,
insomnia
wonderland,
line,
monster,
frankenstein
quite
frankly,
price
paying
hopped
plane
lax
cardigan
fame
excess
(whoa)
in?
jumped
cab,
hollywood
famous
homesick
pressure
nervous
taxi
jay-z
butterflies
noddin'
"yeah"
hips
cab
"who's
town"
definitely
nashville
stilettos
memo
dropped
britney
hopping
flight)
hometown
tonight)
stops
(every
time)
plays
head)
(gonna
okay)
(flying
away)
(movin'
walking
expecting
happens
present
except
worst
excluded
company,
jerk
actual
proof
inspection
breed
accepting
presently
included
arguments
resources
string
divorces
honey,
basement
glow
others
blowing
pieces
show...
hang
[breakdown]
thirty
younger
era,
6]
bigger
clean,
tedious
march
day's
warning
gag
spoon,
unworthy
college
language
corrupt
private
schools
trip
ski
alps
moved
country
sunburn
scalp
contra
contradict
french
connection,
blasted
disconnected
condo
finish
bounced
satellite
dish
california
sits
freezing
stays
uk
against
gel
shivering
cake,
sweets
taste
philly
cheese
steak
toothpaste
tom's
work,
earth?
curse,
earth
isolated
rises
photographic
ordinary
extraordinary
histories
stevens
sleep,
death
sleep
ease
fault
everywhere)
are,
illness
watching,
wrong?
intentionally
suffering
noise
burning
rest,
(or
death)
causes
favor
prey
lonely,
bites,
forgive
be)
(well,
pill
demon
shrouded
shalom
tremendous
weight
ages
outside
murder
not,
shall
way?
changes
apparitions
awry
surround
unholy
bobby
cloud
unknowing
very
trying
forgetting
they've
tide
somewhere,
setting
suns
rodeo
sinking
brings
sunshine
continents
shifting
blocking
exits
false
math
genius
distorted
knowledge
passed
distant
rumble
proud
silent
mutation
evolving
raw
clicking
opportunity
knocking
eviction
recycled
rebellion
assets
static
suburbia
communication
billion
charges
source
code
conjuring
gravity
giving
brakes
slippin'
flippin'
signed
date
dude
non-stop
whine
panties
droppin'
walkin'
hooked
crude
pair,
drifting
wanting
again?
paper-thin
cards,
caving
deep?
six
spark
ignite
fourth
july
firework
awe,
colors
burst
awe
space
original,
replaced
holds
hurricane
rainbow
doors
leads
perfect
bolt,
brighter
moon,
spot,
my—
wrote
symphony
do?)
(tell
you?)
represents
holdin'
grass,
layin'
amaze
note
team?
anymore?
aight,
jt
hesitatin'
ay,
ay
shawty
fan,
(ay)
peru
japan
ruin
(nah)
worldwide
stand-up
private,
candle
(why?)
simply
(haha)
cancel
vacation,
patient,
mean?
boyfriend,
tie
(uh-uh)
obvious
yo'
st.
chill
(nice)
(love)
rock!
1!
2!
feminine
slim
shady
nice,
texted
haiti
90
cops
arrested
80
divide
thirds
diving,
arctic
puffin
puffing
hating
rappers
rocking
mic
electricity
1000
-
era
ah)
stopped
chick's
dixie
middle
aged
botox
third
perspective
facts
catchy
choruses
hypocrite
sex
ended
ballin',
wii
cancer
stephen
hawking
killing,
mocking
raped
childhood
stroll
in,
pole
colon
relax
mathematical
timing
intact
internet
provider
web
horny
spider
apple
orchard
cider
aids
virus
conjunction
junction
spit
bars
molested
uncle
midas
dads
pops,
sucker
usa
border
order
we're,
warrior
princess
finger
scent
south
north
queer
ones
suck
brown
guard
slip
liberty
bell
taco
goliath
wins
sells
silk
widow
spins
time!
now!
what!
hoes,
bitches,
exist
feminist
bras
day-o,
daylight
wan'
rum
(daylight
home)
banana
mornin'
mister
tally
foot,
ripe
deadly
tarantula
jason
derulo]
remix
derulo
minaj
club?
(huh)
teacher,
ropes
fulfill
fantasy
screaming
astronomical
comical
monaco
haha,
short,
psyche
smash
clubs
tiger
wifey
wash
dishes
grits
beijing
remix)
(baby,
fantasy)
(ayo,
singing
ayo)
she'll
(head)
startin'
doctor
fever
breakdown
someone's
cryin'
talkin',
pretend
tongue
razor
vegetable
(you're
vegetable)
(still
buffet
else
rubbin'
shoulders
motor
interlude]
hustlin',
stealin',
baby's
slowly
dyin'
unfurl
ma-ma-say,
ma-ma-sah,
ma-ma-coo-sah
(help
world)
loud)
gentlemen
gentlemen,
tuned
best)
jazzy
chris
brown,
wayne]
eye
beholder
bolder
dip
solar
ford,
lincoln
bentley,
pink
smoking
venus
court
jump
net
sweat
brown]
whatcha
moving,
summer,
doing,
pulling
zipper
tip
shawty,
skipper
shorty,
exit
action,
sunroof
deuce
windows
tinted
gear
(heat
like)
(haha,
woo!)
flyest
summer)
doing)
kenny
again,
official
youtube
tay
james,
homeboy
mac
finna
omaha
mall
2010
mall,
ball
5
tall
spending
cash,
girls,
rocks
york,
compares
star,
james
ry
food
dollar
burger,
chicken
balling
say?
shift
gap
sister
cap,
wait,
ball,
unexplored
islands
cities
yours
froze
under?
risk
snoop
dogg]
greetings,
journey
katy
perry]
grass
greener
warm,
wet
sipping
gin
juice
laying
trees
necks
creep
sneak
peek
(at
us)
golden
coast
oh-oh-oh-oh-oh-oh-oh
unforgettable
bikinis
sun-kissed
melt
popsicle
undeniable
fine,
fresh,
fierce,
represent,
(sex)
jeep
doggy
dogg
stereo,
(once
perry
represent
perry,
tan,
heavy
wild,
ones,
squeeze
(uh!)
girl's
drive
bay
l.a
venice
springs
summertime
homeboys
banging
queenie
lookie
(uh-huh)
representin'
(oh-oh,
coast,
coast)
(aye,
aye)
girls)
(california
jail?
fun?
natural
laughing
beginning
dimension
arm
walkin',
glad
dreaming,
funk
musicians
collins
expectations
intention
smokey
robinson
wailin'
skankin'
bob
marley
expanding
sly
robbie
oops!
surely
he'd
cocaine
[spoken
gibberish
stepping
rhythm
remind
unhappy
greater
depth
unfortunately
rest
ya’ll
focus
flaws
annihilate
festivals
sip
dom
perignon
filet
ray
danse
paris
model
anybody
dollars
titanic
lalalalalala
quand
c'est
life’s
trick
bliss
fed
rub
lip
bon
pure
max
euros
bartender
i’mma
ye
stare,
closer
clear,
beating
escape
vacation
in-between
more,
wandering
mask
swift
sudden
grace
sunny
shadow
tomb
feel?)
inside?
abandoned
armageddon
dogging
beggar
drown
now?)
stranger
moscow
lord
mercy
moscow,
danger
danger,
confess,
achievements
accomplishments
worker
fade
love's
goodbye,
4
winter,
snow
mistakes?
jeff
wise
figured
reason,
sacrifice
lights?
gucci
louis
vuitton
ysl
sell
jail
like?
say:
boy"
goes,
pinocchio
lied
kept
real?
façade
"where's
oughta
guide
beside
l.a.,
chasin'
american
screen
when,
benz
left,
the—
dough
perspective,
deafening
listening
relying
ignore
denying
manic
panic
crisis
scared
admitting
chains
sooner
saviour
tighter
hi,
17,
school,
classmates
names
pusher
introduced
pushers
once,
ran
weeks
later,
mister,
cash
blast
assed
cute
lesson
learn,
learn
movies,
ends
news:
traveling
virginia
cali
hitchhike
rides
calico
desired
family,
tired
there)
(could
spare
see?)
please?
see?
punch
heavy,
february,
valentine,
valentine
regrets,
teenage
touch,
motel
fort
puzzle
piece,
complete
racing
skin-tight
jeans
(tonight,
(you)
(oh),
from,
baby?
nature,
tender
lovin'
ooh-oh
(anywhere
emergency
yearning
sing,
repeat
(na-na-na)
(na-na-na-na)
give,
ooh-ooh
ha-ha-ha,
special
hypnotize
storm
blue
imagine
breeze
inhibitions
nothin
rise,
ride?
(ahh)
you!
doctor,
therapy
money's
soldier
loose
inception
wall
background,
winner
lyin
there'd
left...
close,
twenties,
tens
electricity,
shockwave
central
overload,
legendary
lantern
firm
neatly
2-d]
overload
blossom
electric
flies
giant
bottom
(as
leaps
twilight
(blood
hearted
(hot
line)
flowing
week
depression,
rise
the)
passing
universe,
oh!
simple
sticky
situation
facing
pulled
mama,
station
ol'
peggy
sue
fits
fool?
town,
(would
gosh
trigger,
nigga,
soon?
gonna,
wah
weh
criminal,
mercy,
minimal
dem
evil's
lurking
moonlight
terror
freeze
horror
paralyzed
thriller,
one's
beast
killer
slam
(girl)
creature
creeping
(ooh),
killer,
creatures
masquerade
escaping
jaws
alien
demons
closing
(ooh)
possess
dial
cuddle
ghoul
dare
tight
(ow!)
vincent
jackson]
crawl
search
terrorize
whosoever
hounds
rot
shell
darling
stench
grisly
ghouls
seal
doom
shiver
mere
mortal
resist
mmm,
crush
serious
senses
typically
oops,
sent
innocent
problem
dreaming
wishing
heroes,
truly
ways?
"all
"oh,
beautiful!
minute,
"yeah,
"but
ocean
"well,
(did
(got
lost)
(think
gaga
ate
monster)
(big
boy)
honestly
he’s
wolf
disguise
eyes)
girlfriend
she’d
mumbled
"we
might’ve
fucked,
sure,
recall
tells
yeah"
(wanna
hell)
licked
"girl,
paws
me”
might've
she’s
instead,
dance,
uh-oh,
subway
tore
uh-oh
(he
spreading
news,
it:
vagabond
shoes,
longing
stray
hill,
heap
blues,
melting
brand
sleeps
capital
m,
lipstick
boudoir
are"
"'cause
perfect,
babe"
"so
say"
mistakes
track,
(born
way)
drag,
prudence
kid,
religion
insecure
respect
sin
amore
fe
yah
(same
(way)
be...
evergreen
black,
white,
cholo
descent
orient
outcast,
teased
gay,
straight,
bi
survive
beige
chola
brave!
dna,
robert
campbell]
(one,
two)
takin'
shots
cheers
freakin'
jameson
sink
bastards
short
sitting
miserable
hella
bar,
card
coyote
spiral
freaking
mess,
jag
remove
bags
[pre-hook:
telling
fool,
bout
twisted
[hook:
minute
irreplaceable
untrue
keys
leaves
killah
ayo
calm
flip,
business,
regardless
grind,
rolex
jammed
barrel
gon
pluck
tree
thanks,
hair,
scratch
rip
rhyme
trashed
cus
wink
replacing
pack
bags,
finished
bed,
stomp
track
hollaback
attack,
lead
touchdown,
dude,
bleachers
sock
bites
gwen
stefani]
bananas
boo
stunner
figure,
cutie,
stops,
jordan's
saturday
(into
only)
woman,
kiss)
(can't
one)
delight
expensive
jewels
continental
grand
rental
humble
charms
shape
frost
harry
winston
it!
lass
lawyer
employer
thinks
awful
nice
stocks
beware
descend
affairs
strictly
platonic
bets
pets
baguettes
rolls
straighten
bend
stiff
tiffany's
diamonds!
mood
(huh,
huh)
(uh-huh,
blast,
clash
(no-oh)
hearin'
moanin'
secret
secret,
em
deep,
huh
likin'
standin'
on?
strip
worry,
softer
breathing
neck,
heels,
shirt,
skirt,
jeans,
off,
woah)
control,
feelin',
skin,
just)
skin)
filthy
bathe
ape
milky
legend,
reverend
zone
invited
callin'
alien,
headed
astronaut
hypnotizing
devil?
angel?
floating
glowing
futuristic
dna
'nother
infect
poison
abduction
foreign
supernatural
extraterrestrial
supersonic
powers
stun
lasers
cosmic
magic
transcendental
wavelength
vibrate
driving
spaceships
cop
prada
suit
jars
pockets
rockets
next?
probe
abducted
ester
dean]
na-na-na,
na-na-na-na-na,
na-na-na-na,
na-na-na-na
pleasure
measure
oh-oh-oh-oh-oh)
box,
affliction
air,
sticks
bones
whips
excite
exactly
trunk
car,
boulevard,
bleedin'
over,
roamin'
funeral
swim
beats
808s
cd,
memory
seats
heated
tints
windows,
difference?
ghost,
swayze
mile
stopping
(throw
saving
flares
vest
waves
washin'
plead
insanity
nine
crime,
murder,
crimes,
crimes
letters
pen,
freaky,
freaky
daddy?
crime?
getaway
smooth
evolution,
can,
women,
security,
commitment,
else!
knew.
jealous
type,
very,
aren't
you?"
frank
strawberries
swing
precious
kicking
daydreaming
strawberry
entire
atom
bomb
lawn
hello,
farewell
places
we?
lifting
millions
martin]
haha
younger,
wonder,
like...
songs
guitar
van
chords
saint
david
lunch
park
vinyl
collection
teach
chills,
harmonizing
marvin
"no
fair,
"boy,
judge,
'cause,
singin'
da-da-da
la-da,
lab,
breakfast
by,
holler
purse
drake
blasting
trey
"okay,
swear,
"who
kidding?
stole
singing,
‘bout
ooh-ooh-ooh,
ooh-ooh,
saying
studio
huh?
listening,
were...
bug
mr
hudson]
tears,
smiles
numb
player
gators
1991
soon,
crying
fathers
neither
weren't
there"
there?
warned
soaked
path,
grasp
belong
(run)
belong,
oh...
ohh,
willing
ooh-ooh-ooh-ooh-ooh
complicated?
sometimes,
complicated,
disco
huh!
squeezed
cupid
play,
fame?
game?
dans
involves
touching,
interest,
educated
sex,
block
(huh!)
sick)
sean]
(ooh-ooh-ooh)
(down,
down)
away-ay
(away)
(oh-ooh)
woo!
mmh,
supposed
zero
degree
cold,
overseas
america,
soldier,
fightin'
battlefield
sending
arrows
above?
honestly,
economy
yeah!!
(whoa!)
(falling
monkey
roller
blades
filter
tips
reclining
passenger
chevrolet
liked
face)
'no'
neon
signs
'i
el
proceeded
tracks
mandalay
well?
'if
monkey's
sir,
anyone
butch
sundance
elevator,
panoramic
awoke
fingers
yellow
pages
escort
services
okey
baboon
whores
silver
watched
polished
diggin'
kurt
cobain
'what's
billy
tickets
sheena
ambition
ill
mexican
patience
packing
'my
chasing
amigos,
itchy
declare
stare
ourselves
huh...
messing
(yeah-yeah,
yeah-yeah)
havin'
knees,
beggin',
"please,
thinkin',
hell?
what?
(crazy)
la-la-la,
la-la,
about)
(if
(no),
la-la-la-la-la-la
gunfire
tank,
trail
breathe
could've
masterpiece
fluid
leak
goin',
crashing
lovers
needa
metal
tragedy
pitiful
through,
match
flying
going,
killin'
millionth
criminals
burning,
ambulance
blazing
hipsters
pants
course
glitter
stockings
go-o-o
hard,
our,
tearin'
superstars
dumb,
bodies
numb,
delirious
sellin'
sleepin'
dressin'
we’re
ow!
(get
up!)
on!)
go!)
think?
where's
drink?
(is
kickin
in?)
pharrell
up!
[post-hook:
stage
champagne
flyer
skinny
mini
penny
pussy
image
served
licks
need's
playin
dress,
fur
who?
one-on-one
sex?
sir
7
waking
bowl,
cereal
seein'
tickin'
rushin'
bus,
friends)
kickin'
(gotta
which
take?
friday,
friday
forward
weekend,
partyin'
highway
cruisin'
fast,
seat)
(mind
everybody’s
weekend)
yesterday
thursday,
thursday
we,
excited,
excited
sunday
afterwards
end!
(we
ball)
um,
kings
queens
designer
orleans
drought
hitler's
yea,
jfk
dive
comfortable
pool
porn
homeless
treasure
finding
coins
chocolate
heartbroken,
dora
maps
toilet
holy
craps
voyeur
branch
tossing
salad
neverland
ranch
gothic
conform
anne
diary
suppose
thats
breached
privacy
chased
nazis
bc
caveman
rubbing
clubbing
theres
homo
southern
plantation
owner
servant
slave,
misses
kisses
romantic
disregard
trends
gypsy
redundant
worked
dinner
holocaust
thinner
rape
whistles
intentions
reduce
rate
declines
equal
decline
whistle
sales
rapists
whos
y'know
dicks
coke
pepsi
strongly
plans,
brands
hands,
go"
celebrate
dynamite
crew,
crew
landing
lupe
rule,
fullest
ashamed
color,
accept,
shinin'
asks
okay?"
stares
lips,
laugh,
hates
beautiful,
definition
conceal
silicone
spirit
appearance
mirrors
awhile
a,
account
senior
soda,
where’s
bumping
ad
below
pants?
body's
lollipop
keeping
sucking
nut
rob
asian
kitchen,
either
guillotine
hotty
exchanging
laughter
why’s
dry
humping
towel
after?
spread
naked
wound
healed
yelling
sealed
(i've
erection
protection
convenience
store,
peed
insert
mental
prism
increase
guys
diagram
allergic
cat
wasn’t
best?
course,
(i)
(wrong)
(myself)
(up)
else,
treated
(better)
(forever)
(let
(another
chance)
caved
become
large
(whatcha
say)
(how)
(live)
knowing
(do)
clever
(say,
cheating
do)
large,
is)
say?)
(whoa-oh-oh-oh)
jennifer
lopez
na-na-na-na-na-na
(yes)
(miss
tune,
restroom
lopez]
defend
tried,
style
spellbound
controller
tripping
leaf
clover
"the
changed,
yeah!
parachute
fuel
overwhelm
ha!
(when
math,
pirate
creative
plus
mutant
ironic
balls
titles
france,
decision
division
data,
divided
meal
santa
clause
multiplied
nba
africa
trace
scatter
pencil
j.
fox
moral
proportion
probable
abortion
factor
factors
minds
industrial
smog
opposite
unnatural
log
support
farmers
kennedy
problems,
pastry
bill
predict
volume
value
pie
bolt
struck
reaches
driver,
provided
conductor
percent
chinese
odds
chosen
random
spends
knees?
kim
older
tori
30
considered
expansion
fractions
larger
homework
thirteen
jessie
j]
coconut
pea
sale
serious?
mysterious
shades
heels
tag
the,
cha-ching
ba-bling
unite
blows
video
tired?
happiness
now?
guarantee
left)
right)
strings
(six
(half
cars,
garage
guitars
seconds,
leaping
stumble
defeat,
uh-uh
everyone
moving
j,
(hey!
hey!)
don't,
(dance,
off)
ahh,
ahh
tag,
heh
desert
lies,
conviction
contradiction
karma
chameleon
green,
green
sweet,
addiction
survival
rival
bougie
sleazy,
ooh!
mansion
bottle,
lines,
cheesy
daddy,
dum-dum
drum
beat's
fat,
i-i-i
seduction
technique
impressing
weak
showing
bottles,
drinks
tables
affection
pimp
lame
party's
leaked
slut
shouldn't,
shoulda
stories
tell,
tool,
baller
chick,
bother?
hotter
well...
messed
smart
(oh!)
gross,
(kiss
tell)
garbage
voices)
situation,
suit,
dog
bang
bang,
dead,
jew
wife
ripping
pride,
sake
prophecy,
rights?
invisible
proclamation
promised
liberty,
throwing
government
roosevelt
trash
luther
(we're
fire)
flo
rida]
begin?
"i'm
friends"
at,
at?"
them,
mix
(body)
do's
nails,
chanel
presidents
wallet,
rules,
hotties
reach,
free,
matter,
rush
rida
(girls
at)
yo!
ago,
renewed
license
why'd
verse
dick,
endorse
pause
abort
dat
di
club,
football,
tackle
peeped
lily,
lily
jumpin',
rockers
(woo!)
baby!)
you...
that!
girl?
jock
tattoo,
devilish
flow,
reppin'
led
zeppelin
shufflin'
(shake)
mad,
now!)
lauren
bennett
(put
oh-oh-oh-oh-oh
(hands
rehab
obsession
alley
desperate
calls
hopin'
got,
strung
fried
drug
advice
mama's
devices
addicted,
affected
lovesick
crackhead
crash
crave
slumber
drum?
huh,
so...
beard
will.i.am
steamin'
meanin'
perfection,
mami,
gleamin'
dreamin',
dreamin'
feenin'
screamin'
evenin'
form
team,
king,
mind's
cleanin'
jo
vexed
meantime,
toast
lol
forth
fishin'
convo
heart's
pumpin'
electro
mega
locked,
sunk
bedrock
knocked
headlock
(switch
fiend,
dose
ecstasy
erase
i've,
had,
felt
owe
you-you
i-i
pictures
mo'
burnin'
temperature
chilling
eyed
i'm...
all-all
stone
messin'
maggots
all?
mack
haters
application
ending,
starter
light,
tonight's
(woo-hoo)
sofa,
stressed
spaced
cup,
tov
dancin',
god)
sofa
on),
(drank)
(move
it),
town)
(shut
shot,
rock,
monday,
tuesday,
wednesday
saturday,
get-get-get
woo-hoo
pistol
helplessly
return
wait)
trustin'
comfort
ain’t
interested
haul
iffy
wit
whitney
along)
chu
passionate
claimin'
señorita
forgot
string,
taboo
feel...
real...
ya...
fergie
shit!
shit!)
baby?)
aside
seas,
vip,
pouring
speech
slurring
goose
business
mace
that...
bass
aah,
da,
comin',
love'
support,
[interlude
spoken]
shittin'
bitches!
building,
shrink
celebratin'
guns
rabies
lens
mmm-hmm
mmm-mmm
remote
snap
icon
nikes
kids,
cribs
apartment,
retarded
spits
****
chris,
barely
wall,
before,
later?
contact
favor?
guarantee,
woah-oh)
wondering
yet,
today?
please)
created
human
beings
bombs
wonders
imagined
sunrays
dreamt
phrase
happened?
owned
metronome
breathe,
discipline
learned,
learned?
(look
chase
appeared
wandered
opened
frightened
dreams,
instruction
treats
(outside)
pours
rains
fills
potholes
shade
(the
clouds)
proves
williams
chad
dracula
boogie
wind's
knockin'
torture
sleep)
scared,
then,
realized
hahahahaha
mariah
carey]
(ooooh)
(mmm)
freeway
beats,
roc
dates
role
wheel,
winnie
pooh
backwards
describe,
(whenever
(with
mind)
(feeling
entangled
elude
captivating
buying
property
speeding
velocity
coppin'
capri
harlem
groupies
ma,
5:
catching
spite
mary
blige]
there'll
thing)
diamond,
hurry)
real)
condition
mention
smith]
2
lil'
sushi
mate
grows
chose
seeds
fallen
corridor
applaud
ya)
wonka
ma
lemme
fortune
honesty
prove
attract
j
dedication
refugees
brooklyn
mingled
future,
peeps
sister,
project
jersey
georgie
firelight
stolen
corner
roots,
paper,
brew
remedy
family
oh-ah
high)
hypocrites
wyclef
[?]
remember,
pleasant
echo,
crazy?
possibly
are?
bless
control?
heroes
limb
little,
coincidence
been?
friend?
sun,
malone
song?
overnight
long?
weakness
strong?
embrace
instance,
girlfriend,
bugs
irony
hardest
worries
fears
ryder
noodle
press
harm,
2d
dennis
mountain
existence
mystery
obscured
peaceful
litany
violence
growing
harmony
arrived
hidden
shadows
aeroplanes
sunset
dancing,
caves
unimaginable
sincerity
chance,
stumbled
souls
rich
fueling
chaos
meanwhile,
slept
restlessly
invaded
shadowy
figures
digging
lives?
mined
deeper
mountain,
appear
bitter
chilled
fearful
stir
immense
spoken
then...
usa,
tethered
bump
shoeshine
jungle
vapor
conflict
tail
time's
elimination
cheek
strangers
limelight,
nightlight
(ah-ah-ah)
fading
fence
held
swore
sunrise
life)
('til
sunrise,
sunrise)
animal
asleep,
concrete,
tragic
light)
cracked,
sleaze
(oh-oh-oh-oh-oh-oh-oh)
to—
(what?)
bored
(ha!)
insane,
glitter,
(c'mon!)
blow,
okay?
kesha]
blah,
blah
zip
padlock
jukebox
chit
chat
dick's
music's
stuff,
this?
glove
chase,
playin',
matters
drops,
solo
gotten
trusted
bored,
stoned,
conversation's
found)
twisting
stories,
backstabber
(talk,
talk)
wrapped
mouth)
breath
rippin'
secrets
(taking
telling,
lunatic
boys,
smell,
scruff
habit
where,
got?
boys)
joy
(bring
joy)
less
perfection
boots,
'scuse
spin
rad
stalk
famous,
anus
thirsty,
animal,
cannibal
cannibal,
pitter-patter
liver
platter
tea
goner
jeffrey
dahmer
pulse
confessional
cause,
delusional
destroyed
payback
faded,
zombie
sick,
dinosaur
starin'
creepy
folks
dinosaur,
prehistoric
meat,
citizen
strut
tank
oxygen
bro,
martini
hints
me?"
seriously?
ah!)
rising
(back
faces
(need
dark,
matter?
(ah-ah-ah-ah)
laundry
smells
throbbing
disappears
pretend,
wrong)
whiskey
rock's
painted,
tuesday
faded
"see
watchin'
sleeve
call,
(won't
seriously
send
pretend)
girlfriend)
(see
(not
cold)
(oh-oh),
parties,
disasters
plastered
couch
(oh-oh-oh)
sun's
dodgin'
douchebag
tradin'
sketchy
phases
broke,
shitty
waitress
rocker
pants,
laughed,
sneer
object
choice,
obsession,
(call
pathetic
rejection
girly
art
somehow,
tables,
charm
steve,
pretty?
pet
knit
sweater
waitin')
wrap
me?)
waitin',
feelin')
swimming
pool,
limousines
(c'mon,
cigar
caviar
pissing
this!
oh-oh-oh-oh
dude's
(tonight)
c'mon)
stain
coat?
(party
freaks
pimps
trans
handbag
a—,
a—
hardcore
delirious,
smashed
cans
designated
driver
oh-oh-oh,
(everybody
prechorus
chorus:
sorries
remembering
shared
flashback
shore
indeed
born,
diff'rent
strokes
takes,
finds
alot
theirs,
yours,
[jack
black]
sax
tennessee
gathered
manager
"boy
man!
saxophone
shy,
wail
warmed
this-a
c'mon!
doing?
okay!
bop
bop,
bah
da
on!
[repeat
2x]
huffing
somethin
synergy
energy
temple,
lovin
bush
motion
dandelion
suspect
lotion
+
ups
downs
attractive,
magnetic
attracted
deeper,
(yeah!)
uhh
ohhhhh
yeah..
what'chu
france
w/
libs
her)
have)
nasty
mind?)
behind)
into?
creme
treat
doo
use,
me!
service,
nervous,
this'll
workout
begin
blueprint
'bout,
cinderella,
pumpkin
tina,
tracy
bubble
bath
bubbles
field
flowers
mm-hmm,
goin'?
nelly
furtado]
eye,
comes,
dope
supermodel
mommy
—
amnesty
international,
bangkok
abs
mil'
upper
respected
piano
charts
greasy,
act
"just
missed
[break:
(damn,
sigh
steady
wasting
hill
unforgiven
manifest
destiny,
underground?
gray
indecision
believing
vision
last,
divine
intervention
snatch
love!
just,
carmen,
deceit
receipt
exists
try,
goals
echoing
hears
whispers
moonlit
reflect
towards
ancient
melodies
you!"
drag
dogs
restless
solitary
whats
kilimanjaro
olympus
seek
of,
keyboard
blessing
rains,
repeats
song]
sweetness
bangin'
brother's
forfeit
slicker
thicker
horse's
carmen
speechless
features
cats
peaches
,
twist
whack,
quarter
curves
cul-de-sac
cream,
lieutenant
wonderin'
[sam
mel
gibson
danny
them?
postpone
goals,
tricks
sleeve?
cuffs
locking
warrant
trial
[sam]
chair
x2]
officer
covers
(game
talker
thighs,
em'
patrick
passin'
parking
bulls
barkin'
lou
stalkin'
too,
gospel
hostile
bouncin'
profit
honor
fittest
wig
bits
dealin'
physical
clutches
punches
mc's
crashin
crawling
wickedest
exquisite
gains
lets
deception
eternal
reflection
authority
doubt,
cheeba
keepin'
talking]
mcs
up...
oriental
chess
flies,
spa
level,
venue
philippines
place!
world's
oyster
pearls
cloister
sliding
town's
head's
bore,
board,
whaddaya
crowded,
stinking
tea,
suite
tourist
among
purest
despair
tumble
witness
ultimate
cerebral
fitness
grips
muddy
river
buddha
controlling
rating
contemplating
bars,
temples
massage
flesh,
derek
resisting
hey!
booking
d
prints
frontal
retire
platinum
bracelets
wrists
heal
job
reveal
peel
surprising
weed
locked
no!
dont
thigh,
decency
instincts
moments
enrique
iglesias]
nation
nobody's
motivation,
given
reputation
lied,
stunt
all)
fall)
(dance)
mercy!
officially
refugee
camp
michael]
through)
shocking
(no!)
nuthin
disgusting
aiming
stuffy
standing,
forte
mj
fey
flowin'
g
six,
cramp
t
o
battery
seasons
hunting
slapped
sire
joking,
hasta
vista
creepin'
undefeated
team
steel
charge
manila
9-5
shaq
brooke
hogan
watchin',
wishin'
wall?
movin',
grill
how's
media
fo'
inch
switchin'
lanes
95
swervin'
popped
crumbs
concerned
funds
flash
wrist,
johnny
dane
karat
chatter
pinky
lean
also
ballin'
slab
fifth
wheels
gossip
stop!
rumors
naw
(look)
[rap
bang-bang
mrs.
personality
(verse
1)
brave,
discretion
curious
chap
2)
experimental
nature
behave
obey
bridge:
magical
kissable
resist,
deal,
details,
heaven,
especially
two's
movin
wonderin
lookin
vibe,
cos
g]
who,
european
andre
england
stomping
(till
dawn)
(baby
groove)
projects,
ginger
pro
joe
marilyn
monroe
girlfriends
nas
boats
sixes
japanese
cooked
trips,
sets
missin'
inside,
(yes,
did)
yes)
(i'ma
alright)
(be
(days
stay)
true)
(living
crazy)
understands
peoples
bail
stressin'
kingpin
bling
lesser
claim
fights,
hairs
(said
williams]
wha?
(no
lose)
beep
beep,
luxury
(say
feel)
are)
(whoo!)
anticipating
flew
snooze
amongst
sat
def
doin
e
f
drug,
kanye,
offa
nicole
scherzinger]
ha-ha,
ha-ha
the...
brains,
my...
ha-ha-ha
boy's
seventh
no?
cents
one;
patient
anxious
aggressive
ahhh
know...
don't...
there...
[post-chorus
boom-boom,
boom-boom
something,
melody
/
outro:
tryin
everytime
thinkin
fantasize
tingle
rubbin
analyze
feelin
wan't
fools
lack
swingin
porch
[michael
acknowledge
smile,
an'
butterflies,
crop
plot
hand,
(girl,
(boy,
(boy)
drift
secretly,
lifts
unhappy,
suddenly
adore
fiending
races
motorola
rings
wish,
suddenly,
whirl
yacht
eighth
jewelry,
chrome,
wow,
combs
hottie
carat
savage,
cake
mark
jacob,
heartbreaker
mobster
keys,
lobster
shrimp
hook,
mill
carey
spears]
understand?
spotted
thang,
conceited
guy,
(so,
puts
meeting
destiny
know?)
nasty)
judging
that?)
spears
krayzie
basically
pretended
o.k
unyielding
sacred
nonchalant
guise
gradually
(underneath
smile)
devoted
clue
cling
pride
lash
"how
way"
vain
(losing
(under
feel?
suffering,
situations
far,
troubles
aw
nevertheless
ending
struggles
breaks
rely
shoulder
thug
underestimate
pac
struggles,
crying)
inside)
cry)
i...)
killa,
ma'
mimi
waikiki
teddy
thrilled
l,
lounge
shore,
mags
feet,
juelz
santana
jimmy
jones]
her?
carry
fightin',
carryin'
appears
askin'
aspen
house,
tub
relaxing
stacking
laughin'
uh-huh)
(why
(show
sing)
war's
snaps
freakin
kite
clink
letter
think,
stressing
release
6:
pressures
(cry,
boo?
pussycat
showdown
reachin'
loosen
buttons,
(uh-huh!)
fronting,
typical
(mama)
(wanna)
(told
(see)
fitting
beat?
(beat)
agree
recognize
whoa)
proceed
dog,
babydoll
nicole,
jessica,
melody,
babe?
(oh...)
ludacris
taio
cruz]
deceive
start,
evade
misbehaving
(thats
woman)
shatter
splatter
itty-bitty
keepers,
losers
weepers
feel!
karma's
wolf,
christina
aguilera]
'sposed
woman?
easier
smiled
female
popularity
controversy
sad)
(around
who've
girls?
louder!
lettin'
(stand
ground)
(hold
offended
society
glory,
whore
kim]
worth)
rid
(check
same,
turn,
ideas
whack
cute,
coy
smaller
annoy
girls!
worth,
(shout
missy
fish,
shark
exclusive
again)
phenomenal
catch,
whoo
wash,
ooooh,
rich,
ditch
thief
whoo,
planning
rags
machines
humming
washed
elliott
sharks
grim
bets,
nightmare
surface
washing
superstar
ahhhh
hit)
swizz
beatz
thug]
clowns
gangsta's
'head
background
i'm-a
twerk
flaunt
amazement
patience,
bore
tease,
checking
boo,
glance
view
glue
trance,
grind
dc
h-town
ladies)
it...)
(you,
mine)
paul]
tennessee,
timbaland
south,
lookin',
spotlight
curve
hourglass
frame
alcohol
entertain
o'
runaround
clown
lady)
easy,
town?
tim,
a.k.a.
thomas
crown
around?
problem,
navigator
compass
genie,
housewives
simon
parental
advised
54
props
strongest
cigarettes
cells
bills
pig
tails
jackson,
rivers
juicy
ghetto
fab
games,
spinnin'
chirp
mobile
wrestling
good?
fest
sorrows
hennessy
screwed
chop
(off
melody)
(please
happening?
untimely
medicine,
clinging
bittersweet
number,
pager
cousin
friend's
tippy
:
stereo
relief
up?)
suppressing
early
september
bear
(ya
"let
"a
today"
you's
crybaby
do-do-do-do-do
i...
beyoncé
base
juan
pierre
snare
birkin
b.
hurtin'
birthed
everywhere,
audacity
curtains
sting,
reminisce,
compare
substitute
déjà
vu
seeing
dreaming?
glimpse
unusual
dro
study
vein
sniffin'
dope,
convict
scales
tippin'
chicago
ever?
list,
factory
vu,
deja
plane,
vu?
redman
dirty,
filthy,
christina,
gentleman,
alarm,
elbows
there?)
dawgs
overdue
paid
dues,
hands)
(that's
jam)
thumpin'
crashin'
temperature's
(can
erupt
rowdy
unruly
drippin'
naughty
arrival
fellas,
cups
ass,
(low
sure)
open,
commotion
stoppin',
rockin',
everyone's
(give
me),
yup,
maximum
doc
dummy
divas
(ow)
sleeves
(what?),
color
packed,
lauryn
wrap,
bargain
deals
brick
city,
blessed,
bernie
dogs,
(party)
rowdy,
(happy,
na)
p]
intimacy
hype
immature
conversations
painfully
illusion
destined
daze
do!
things)
in)
more)
fault)
sometimes)
messages
voicemails
diss
issue,
(something
to)
(am
sometime
(shake,
shake)
conclusion
confusion,
self-esteem
ronnie
hallway
(ooh-ooh)
much?
oh-ooh
ow
shopping,
get,
(slow
(go
(damn
wiser
teen,
(one
take,
crib,
sunset,
phantom
chew
gum
wrist
boss,
tony
montana
carter
plaques
charter
wayne
paula
busta
(uhh)
soldiers,
sizzle
prowl
lookout
dance)
belly
dancer
wit'
tricks,
see)
cha
cha?
(fight
feeling)
(leave
alone)
(uh-uh,
uh-uh)
ah-ah)
cha,
fun)
ménage
*****
almighty,
aston
vanquish
lingerie
(ha)
magnum
wagon,
record,
lifetime)
safe
hot)
woo,
ugh
thing!
[dj
eee
clap
rapper
roof,
tires
(shake
ass)
(watch
yourself)
feet)
heads
funky
truck
sucker,
bowl
munchies
cutting
mc
jordans
debut
still?
show)
jamaican
funk,
(feel)
(clap
simplicity
touching
tres,
y'all,
delicious
loco
treasures
pleasures
reasons
tease
promiscuous
suspicious
fictitious
lining
rock)
got)
stacy
vicious
gym,
out!
tasty,
tasty
laced
d,
(hit
brothas
uhhh
clientele
(i,
[pre
hook]
pursue
exchange
thangs
oooh,
verse]
tight,
smelling
daughter
frankie
beverly
fan
celebrity
geeked
jermaine
motherfucker,
number?
about?
damn!
tonight?
night!
penthouse
filling
(baby)
lalalala,
lalalala
lala,
lala
jordan
knight
remix,
slick
v,
babygirl
convinced
1
[breakdown
instrumental]
satisfy
don]
don,
"if
class,
popping
glamorous
flossy
glamorous,
shopping
screens,
scenes
pristine
queen,
bell,
sipping,
reminiscing
mustang
wishes,
finer
lettuce
shoe
fetish
lifestyle
robin
leach
rome
problems
y'all)
thank,
yesterday,
mtv,
that'd
industry
it!)
deceitful
speaks
lines
goal
can´t
heartbreaking
actions
onto
caring
[rap:
playing,
crap,
heartbreaker,
talked
25
day)
june
(came
soon)
jobs,
jokes
funny?
learned
school?
heather
interfere
keep,
(goodbye)
la...
somehow?
'round?
goodbye)
remember)
whatever)
always)
(always
intro]
chills
spill
satisfaction
dig
supper
dish,
(uh
me!)
out!)
hula
hoop
sold
malicious
collins]
torso
delightful,
delightful
'specially
hendrix
haze
motion,
maze
hilt
rhythm,
glowin'
(eyes)
dive,
stoop
loop
pied
piper,
(na
three)
[ad
horns
hmmmmm
wilderness
incomplete,
christina]
virgin
touched
virgin,
whoa-oh,
whoa-oh
(everybody,
everybody)
spears,
hollywood,
britney,
flip
reverse
station,
channel
stations
concepts
aight
jigga
disarming
midst
incessantly
euphoric
persuade
relinquish
(why,
pillow
block,
spying
jay,
chicks,
inspect
hers
access
tattoo
moms
apart,
scribble
does,
(right
known)
styles
compare,
dependency
washes
addicted
darlin',
describe
elusive
blatant
